RhinoInside.Revit API Documentation
GeometryDecoder.ToPoint3d Method
 Converts the specified XYZ point to an equivalent Rhino Point3d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Rhino.Geometry.Point3d ToPoint3d(
	this Autodesk.Revit.DB.XYZ value
)
Parameters
value
Type: Autodesk.Revit.DB.XYZ
A value to convert.
Return Value
Type: Rhino.Geometry.Point3d
A Rhino Point3d that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.XYZ. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace